abitoftheold/trunk/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "status") VALUES(NULL, '2009-10-27 01:05:52', '2009-10-27 01:05:52', NULL)

  def update_status
    @user = User.find(params[:id])
    @user.status = @user[:status] == "Out" ? "In" : "Out"
    @user.save!
---
SELECT * FROM "users" WHERE ("users"."id" = 6)
UPDATE "users" SET "updated_at" = '2009-10-28 12:12:59', "status" = 'In' WHERE "id" = 6